Tekla Open API Reference for Tekla Structures 2025
BaseWeld.Placement Property
 Gets or sets the weld placement.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BaseWeld.WeldPlacementTypeEnum Placement { get; set; }
Public Property Placement As BaseWeld.WeldPlacementTypeEnum
	Get
	Set
Property Value
Type: BaseWeld.WeldPlacementTypeEnum
Exceptions
Exception | Condition
ArgumentException | Thrown when provided value is not defined in the WeldPlacementTypeEnum.
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace